CFD-THM-coupling/thermal_transient/coupled/foam_cfd/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

U 2;
I 0.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform #calc "1.5 * $U*$I * $U*$I";
    }
    outlet
    {
        type            zeroGradient;
    }
    pipe
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}
