CFD-THM-coupling/thermal_transient/coupled/foam_cfd/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   uniform 0; 


boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.;
    }	
    outlet
    {
        type            calculated;
        value           uniform 0.; 
    }
    pipe
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
