CFD-THM-coupling/thermal_transient/coupled/foam_cfd/constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType  RAS;

RAS
{
    model            kEpsilon;
    turbulence             on;
}
