CFD-THM-coupling/thermal_transient/coupled/foam_cfd/system/decomposeParDict
FoamFile {
    version 2.0;
    class dictionary;
    object decomposeParDict;
    format ascii;
}

numberOfSubdomains 4;

method          scotch;
